Show / Hide Table of Contents
Interface IIdeaStaticaApp
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IIdeaStaticaApp
Methods
Improve this Doc   View Source
GetAllConnectionData(Int32)
Get structural data and corresponding results of FE analysi for connectionId
Declaration
[OperationContract]
string GetAllConnectionData(int connectionId)
Parameters
 Type |  Name |  Description
 System.Int32 |  connectionId
Identifier of the required connection
Returns
 Type |  Description
 System.String
XML string which prepresents the instance of of IdeaRS.OpenModel.OpenModelContainer (stuctural data and results of FE analysis)
Improve this Doc   View Source
GetConnectionModel(Int32)
Get connection model in IOM format
Declaration
[OperationContract]
ConnectionData GetConnectionModel(int connectionId)
Parameters
 Type |  Name |  Description
 System.Int32 |  connectionId
The ID of the connection in the project
Returns
 Type |  Description
 ConnectionData
Connection model
Improve this Doc   View Source
GetCssInMPRL(CountryCode)
Get all cross-sections from IDEA StatiCa MPRL (material and product range library) which belongs to countryCode
Declaration
[OperationContract]
List<LibraryItem> GetCssInMPRL(CountryCode countryCode)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
Country code filter
Returns
 Type |  Description
 System.Collections.Generic.List<LibraryItem>
Cross-sections in the MPRL
Improve this Doc   View Source
GetCssInProject()
Get all cross-sections in the currently open project
Declaration
[OperationContract]
List<ProjectItem> GetCssInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Cross-sections in the project
Improve this Doc   View Source
GetMaterialsInMPRL(CountryCode)
Get all materials from IDEA StatiCa MPRL (material and product range library) which belongs to countryCode
Declaration
[OperationContract]
List<LibraryItem> GetMaterialsInMPRL(CountryCode countryCode)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
Country code filter
Returns
 Type |  Description
 System.Collections.Generic.List<LibraryItem>
Materials in the MPRL
Improve this Doc   View Source
GetMaterialsInProject()
Get all materials in the currently open project
Declaration
[OperationContract]
List<ProjectItem> GetMaterialsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Materials in the project
 Improve this Doc
 View Source